@edwardmedia I created sample TF project like this:
```
├── gke
│   └── main.tf
├── job
│   ├── main.tf
│   └── variables.tf
├── main.tf
├── main.tfvars
├── variables.tf
└── versions.tf
```

Do not get confused by fact that `gke/main.tf` has only public IP address; in our case, it has entire GKE cluster. I just wanted to reproduce the scenario as closely as possible while staying minimalist.

gke/main.tf
```tf
resource google_compute_global_address default {
	name = "my-global-ip"
}
```

job/main.tf
```tf
resource google_service_account job {
  for_each = toset(var.jobs)

  account_id = each.value
}

data google_iam_policy job_workload_identity {
  for_each = toset(var.jobs)

  binding {
    role = "roles/iam.workloadIdentityUser"
    members = [
      "serviceAccount:my_playground.svc.id.goog[${var.gke_ns}/${each.value}]"
    ]
  }
}

resource google_service_account_iam_policy job_workload_identity {
  for_each = toset(var.jobs)

  service_account_id = google_service_account.job[each.value].name
  policy_data        = data.google_iam_policy.job_workload_identity[each.value].policy_data
}
```

job/variables.tf
```tf
variable jobs {
  type        = list(string)
  description = "List of jobs running for given namespace"
}

variable gke_ns {
  type        = string
  description = "GKE namespace"
}
```

main.tf
```tf
module test {
  source   = "./job"
  for_each = toset(["namespace1", "namespace3"])

  gke_ns = each.value
  jobs   = var.jobs

  depends_on = [module.gke]
}

module gke {
  source = "./gke"
}
```

variables.tf
```tf
variable jobs {
  type        = list(string)
  description = "List of jobs running for given namespace"
}
```

```tf
terraform {
  required_version = "0.13.5"
  backend gcs { bucket = "my-playground-terraform-state" }

  required_providers {
    google = { source = "hashicorp/google" }
  }
}

provider google {
  version = "3.49.0"

  project = "my-playground"
  region  = "us-central1"
}
```

main.tfvars
```
jobs = []
```

Run `terraform apply -var-file="main.tfvars"`. It should end up with:
```
Initializing modules...
- gke in gke
- test in job

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "3.49.0"...
- Using hashicorp/google v3.49.0 from the shared cache directory

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gke.google_compute_global_address.default will be created
  + resource "google_compute_global_address" "default" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "my-global-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.gke.google_compute_global_address.default: Creating...
module.gke.google_compute_global_address.default: Still creating... [10s elapsed]
module.gke.google_compute_global_address.default: Creation complete after 12s [id=projects/hmplayground/global/addresses/my-global-ip]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Change the `jobs = []` to `jobs = ["foobar"]`. This may fail because `my_playground.svc.id.goog` may not exist in your GCP project (unless you create GKE cluster with Workload Identity enabled), but please ignore that for now. You should end up with:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.test["namespace1"].data.google_iam_policy.job_workload_identity["foobar"] will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "job_workload_identity"  {
      + id          = "1437195181"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:my_project.svc.id.goog[namespace1/foobar]",
                        ]
                      + role    = "roles/iam.workloadIdentityUser"
                    },
                ]
            }
        )

      + binding {
          + members = [
              + "serviceAccount:my_project.svc.id.goog[namespace1/foobar]",
            ]
          + role    = "roles/iam.workloadIdentityUser"
        }
    }

  # module.test["namespace1"].google_service_account.job["foobar"] will be created
  + resource "google_service_account" "job" {
      + account_id = "foobar"
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.test["namespace1"].google_service_account_iam_policy.job_workload_identity["foobar"] will be created
  + resource "google_service_account_iam_policy" "job_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + policy_data        = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:my_project.svc.id.goog[namespace1/foobar]",
                        ]
                      + role    = "roles/iam.workloadIdentityUser"
                    },
                ]
            }
        )
      + service_account_id = (known after apply)
    }

  # module.test["namespace3"].data.google_iam_policy.job_workload_identity["foobar"] will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "job_workload_identity"  {
      + id          = "1457686721"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:my_project.svc.id.goog[namespace3/foobar]",
                        ]
                      + role    = "roles/iam.workloadIdentityUser"
                    },
                ]
            }
        )

      + binding {
          + members = [
              + "serviceAccount:my_project.svc.id.goog[namespace3/foobar]",
            ]
          + role    = "roles/iam.workloadIdentityUser"
        }
    }

  # module.test["namespace3"].google_service_account.job["foobar"] will be created
  + resource "google_service_account" "job" {
      + account_id = "foobar"
      + email      = (known after apply)
      + id         = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.test["namespace3"].google_service_account_iam_policy.job_workload_identity["foobar"] will be created
  + resource "google_service_account_iam_policy" "job_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + policy_data        = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:my_project.svc.id.goog[namespace3/foobar]",
                        ]
                      + role    = "roles/iam.workloadIdentityUser"
                    },
                ]
            }
        )
      + service_account_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.test["namespace1"].data.google_iam_policy.job_workload_identity["foobar"]: Reading...
module.test["namespace1"].data.google_iam_policy.job_workload_identity["foobar"]: Read complete after 0s [id=1437195181]
module.test["namespace3"].data.google_iam_policy.job_workload_identity["foobar"]: Reading...
module.test["namespace3"].data.google_iam_policy.job_workload_identity["foobar"]: Read complete after 0s [id=1457686721]
module.test["namespace3"].google_service_account.job["foobar"]: Creating...
module.test["namespace1"].google_service_account.job["foobar"]: Creating...
module.test["namespace3"].google_service_account.job["foobar"]: Creation complete after 3s [id=projects/hmplayground/serviceAccounts/foobar@hmplayground.iam.gserviceaccount.com]
module.test["namespace3"].google_service_account_iam_policy.job_workload_identity["foobar"]: Creating...

Error: Error creating service account: googleapi: Error 409: Service account foobar already exists within project projects/hmplayground., alreadyExists



Error: Error setting IAM policy for service account 'projects/hmplayground/serviceAccounts/foobar@hmplayground.iam.gserviceaccount.com': googleapi: Error 400: Invalid service account (my_project.svc.id.goog[namespace3/foobar])., badRequest
```

Change the `jobs = ["foobar"]` to `jobs = ["foobar", "barbaz"]` and apply again.
```
module.gke.google_compute_global_address.default: Refreshing state... [id=projects/hmplayground/global/addresses/my-global-ip]
module.test["namespace1"].data.google_iam_policy.job_workload_identity["foobar"]: Refreshing state... [id=1437195181]
module.test["namespace3"].data.google_iam_policy.job_workload_identity["foobar"]: Refreshing state... [id=1457686721]
module.test["namespace3"].google_service_account.job["foobar"]: Refreshing state... [id=projects/hmplayground/serviceAccounts/foobar@hmplayground.iam.gserviceaccount.com]

Error: Invalid index

  on job/main.tf line 22, in resource "google_service_account_iam_policy" "job_workload_identity":
  22:   policy_data        = data.google_iam_policy.job_workload_identity[each.value].policy_data
    |----------------
    | data.google_iam_policy.job_workload_identity is object with 1 attribute "foobar"
    | each.value is "barbaz"

The given key does not identify an element in this collection value.


Error: Invalid index

  on job/main.tf line 22, in resource "google_service_account_iam_policy" "job_workload_identity":
  22:   policy_data        = data.google_iam_policy.job_workload_identity[each.value].policy_data
    |----------------
    | data.google_iam_policy.job_workload_identity is object with 1 attribute "foobar"
    | each.value is "barbaz"

The given key does not identify an element in this collection value.
```

Now, comment out `depends_on = [module.gke]` and apply again. You should see different result.